Repository: geek4ctrl/state-council-admin
Catalog: src/locale/messages.*.xlf
Languages: fr

# navToggleLabel
source: Toggle navigation menu
fr: Basculer le menu de navigation

# headerGreeting
source: Hello, {INTERPOLATION}
fr: Bonjour, {INTERPOLATION}

# themeSwitchToLight
source: Switch to light theme
fr: Passer au theme clair

# themeSwitchToDark
source: Switch to dark theme
fr: Passer au theme sombre

# headerGuest
source: Guest
fr: Invite

# sidebarNavLabel
source: Main navigation
fr: Navigation principale

# sidebarTitle
source: State Council Admin
fr: Administration du Conseil d'Etat

# sidebarCloseLabel
source: Close navigation menu
fr: Fermer le menu de navigation

# sidebarLogoutLabel
source: Log out of your account
fr: Se deconnecter de votre compte

# sidebarLogoutText
source: Log Out
fr: Se deconnecter

# navDashboard
source: Dashboard
fr: Tableau de bord

# navPosts
source: Posts
fr: Articles

# navSettings
source: Settings
fr: Parametres

# confirmLogoutTitle
source: Logout
fr: Deconnexion

# confirmLogoutMessage
source: Are you sure you want to log out?
fr: Voulez-vous vraiment vous deconnecter ?

# confirmLogoutConfirm
source: Logout
fr: Se deconnecter

# confirmCancel
source: Cancel
fr: Annuler

# confirmDefault
source: Confirm
fr: Confirmer

# modalCloseLabel
source: Close modal
fr: Fermer la fenetre

# modalCancelLabel
source: Cancel action
fr: Annuler l'action

# modalConfirmAria
source: Confirm: {INTERPOLATION}
fr: Confirmer : {INTERPOLATION}

# toastCloseLabel
source: Close notification
fr: Fermer la notification

# placeholderTitle
source: Coming Soon
fr: Bientot disponible

# placeholderSubtitle
source: This feature is under development
fr: Cette fonctionnalite est en cours de developpement

# loginLogoText
source: State Council
fr: Conseil d'Etat

# loginRegisterTitle
source: Create your account
fr: Creez votre compte

# loginRegisterSubtitle
source: Fill in your details to get started
fr: Renseignez vos informations pour commencer

# loginWelcomeTitle
source: Welcome to State Council
fr: Bienvenue au Conseil d'Etat

# loginWelcomeSubtitle
source: Please login to your account
fr: Veuillez vous connecter a votre compte

# registerFormLabel
source: Create account form
fr: Formulaire de creation de compte

# emailAddressLabel
source: Email Address
fr: Adresse e-mail

# emailPlaceholder
source: you@example.com
fr: vous@exemple.com

# passwordLabel
source: Password
fr: Mot de passe

# createPasswordPlaceholder
source: Create a password
fr: Creez un mot de passe

# confirmPasswordLabel
source: Confirm Password
fr: Confirmez le mot de passe

# confirmPasswordPlaceholder
source: Confirm your password
fr: Confirmez votre mot de passe

# createAccountLabel
source: Create your account
fr: Creez votre compte

# createAccountLoading
source: CREATING ACCOUNT...
fr: CREATION DU COMPTE...

# createAccountText
source: CREATE ACCOUNT
fr: CREER UN COMPTE

# existingAccountText
source: Already have an account?
fr: Vous avez deja un compte ?

# signInButton
source: Sign In
fr: Se connecter

# loginFormLabel
source: Login form
fr: Formulaire de connexion

# rememberMeLabel
source: Remember me
fr: Se souvenir de moi

# rememberMeText
source: Remember me
fr: Se souvenir de moi

# forgotPasswordLabel
source: Forgot your password
fr: Mot de passe oublie

# forgotPasswordText
source: Forgot your password?
fr: Mot de passe oublie ?

# loginAccountLabel
source: Login to your account
fr: Se connecter a votre compte

# loginLoading
source: SIGNING IN...
fr: CONNEXION...

# loginText
source: LOGIN
fr: SE CONNECTER

# newUserText
source: New User?
fr: Nouveau utilisateur ?

# createAccountLink
source: Create an Account
fr: Creer un compte

# loginFooterText
source: Registering to this website, you accept our {START_TAG_A}{INTERPOLATION}{CLOSE_TAG_A} and our {START_TAG_A_1}{INTERPOLATION_1}{CLOSE_TAG_A_1}
fr: En vous inscrivant sur ce site, vous acceptez nos {START_TAG_A}{INTERPOLATION}{CLOSE_TAG_A} et notre {START_TAG_A_1}{INTERPOLATION_1}{CLOSE_TAG_A_1}

# termsUseLabel
source: Read our terms of use
fr: Lire nos conditions d'utilisation

# privacyPolicyLabel
source: Read our privacy policy
fr: Lire notre politique de confidentialite

# loginCopyright
source: © 2026 State Council. All rights reserved
fr: © 2026 State Council. Tous droits reserves

# loginSuccessToast
source: Login successful! Welcome back.
fr: Connexion reussie ! Bon retour.

# loginInvalidMessage
source: Invalid email or password.
fr: Adresse e-mail ou mot de passe invalide.

# loginInvalidToast
source: Invalid email or password. Please try again.
fr: Adresse e-mail ou mot de passe invalide. Veuillez reessayer.

# registerPasswordMismatch
source: Passwords do not match.
fr: Les mots de passe ne correspondent pas.

# registerSuccessToast
source: Account created successfully. Please sign in.
fr: Compte cree avec succes. Veuillez vous connecter.

# registerErrorMessage
source: Unable to create account. Please try again.
fr: Impossible de creer le compte. Veuillez reessayer.

# registerErrorToast
source: Registration failed. Please try again.
fr: Echec de l'inscription. Veuillez reessayer.

# dashboardTitle
source: Dashboard
fr: Tableau de bord

# dashboardRecentPosts
source: Recent Posts
fr: Articles recents

# dashboardViewAllLabel
source: View all blog posts
fr: Voir tous les articles

# dashboardViewAllText
source: View All →
fr: Voir tout →

# dashboardViewPostLabel
source: View post: {INTERPOLATION}
fr: Voir l'article : {INTERPOLATION}

# dashboardCoverAlt
source: Cover image for {INTERPOLATION}
fr: Image de couverture pour {INTERPOLATION}

# dashboardCategoryLabel
source: Category
fr: Categorie

# dashboardEmptyPosts
source: No posts yet
fr: Aucun article pour le moment

# dashboardLoadError
source: Failed to load recent posts.
fr: Impossible de charger les articles recents.

# postsTitle
source: All Posts
fr: Tous les articles

# postsCreateLabel
source: Create a new blog post
fr: Creer un nouvel article

# postsNewButton
source: New Post
fr: Nouvel article

# postsCoverAlt
source: Cover image for {INTERPOLATION}
fr: Image de couverture pour {INTERPOLATION}

# postsCategoryLabel
source: Category
fr: Categorie

# postsMetaLabel
source: Post metadata
fr: Metadonnees de l'article

# postsTimeLabel
source: Time
fr: Heure

# postsLocationLabel
source: Location
fr: Lieu

# postsViewDetailsLabel
source: View details for {INTERPOLATION}
fr: Voir les details pour {INTERPOLATION}

# postsViewDetailsText
source: View Details
fr: Voir les details

# postsActionsLabel
source: Post actions
fr: Actions de l'article

# postsEditLabel
source: Edit {INTERPOLATION}
fr: Modifier {INTERPOLATION}

# postsDeleteLabel
source: Delete {INTERPOLATION}
fr: Supprimer {INTERPOLATION}

# postsEmptyText
source: No posts yet. Create your first post!
fr: Aucun article. Creez votre premier article !

# postsCreateFirstLabel
source: Create your first post
fr: Creer votre premier article

# postsCreateFirstButton
source: Create Post
fr: Creer un article

# postsPaginationLabel
source: Posts pagination
fr: Pagination des articles

# postsPrevLabel
source: Go to previous page
fr: Aller a la page precedente

# postsPrevText
source: Previous
fr: Precedent

# postsPageCount
source: Page {INTERPOLATION} of {INTERPOLATION_1}
fr: Page {INTERPOLATION} sur {INTERPOLATION_1}

# postsRangeCount
source: {INTERPOLATION}-{INTERPOLATION_1} of {INTERPOLATION_2} posts
fr: {INTERPOLATION}-{INTERPOLATION_1} sur {INTERPOLATION_2} articles

# postsNextLabel
source: Go to next page
fr: Aller a la page suivante

# postsNextText
source: Next
fr: Suivant

# postsLoadError
source: Failed to load posts. Please try again.
fr: Impossible de charger les articles. Veuillez reessayer.

# postsDeleteTitle
source: Delete Post
fr: Supprimer l'article

# postsDeleteMessage
source: Are you sure you want to delete this post? This action cannot be undone.
fr: Voulez-vous vraiment supprimer cet article ? Cette action est irreversible.

# postsDeleteConfirm
source: Delete
fr: Supprimer

# postsDeleteSuccess
source: Post deleted successfully
fr: Article supprime avec succes

# postsDeleteError
source: Failed to delete post
fr: Echec de la suppression de l'article

# postDetailBack
source: « Back to Posts
fr: « Retour aux articles

# postDetailEdit
source: Edit Post
fr: Modifier l'article

# postDetailDelete
source: Delete
fr: Supprimer

# postDetailExternalLink
source: 🔗 External Link
fr: 🔗 Lien externe

# postDetailShownHome
source: ✓ Shown on Home Page
fr: ✓ Affiche sur la page d'accueil

# postDetailShownRegistration
source: ✓ Shown on Registration
fr: ✓ Affiche a l'inscription

# postDetailCreated
source: Created:
fr: Cree :

# postDetailUpdated
source: Updated:
fr: Mis a jour :

# postDetailNotFound
source: Post not found
fr: Article introuvable

# postDetailGoBack
source: Go Back
fr: Retour

# postDetailLoadError
source: Failed to load post
fr: Impossible de charger l'article

# postFormBack
source: « Back
fr: « Retour

# postFormEditTitle
source: Edit Post
fr: Modifier l'article

# postFormNewTitle
source: New Post
fr: Nouvel article

# postFormCategory
source: Category
fr: Categorie

# postFormCategoryEvent
source: Event
fr: Evenement

# postFormCategoryAnnouncement
source: Announcement
fr: Annonce

# postFormCategoryNews
source: News
fr: Actualites

# postFormTitle
source: Title
fr: Titre

# postFormTitlePlaceholder
source: Enter post title
fr: Saisissez le titre de l'article

# postFormImageUrl
source: Image URL
fr: URL de l'image

# postFormImagePlaceholder
source: https://example.com/image.jpg
fr: https://exemple.com/image.jpg

# postFormImagePreview
source: Preview
fr: Apercu

# postFormExcerpt
source: Excerpt
fr: Extrait

# postFormExcerptPlaceholder
source: Brief description...
fr: Description breve...

# postFormContent
source: Content
fr: Contenu

# postFormContentPlaceholder
source: Write your post content here...
fr: Ecrivez le contenu de votre article ici...

# postFormTime
source: Time
fr: Heure

# postFormLocation
source: Location (Optional)
fr: Lieu (optionnel)

# postFormLocationPlaceholder
source: Event location
fr: Lieu de l'evenement

# postFormExternalLink
source: External Link (Optional)
fr: Lien externe (optionnel)

# postFormExternalLinkPlaceholder
source: https://example.com
fr: https://exemple.com

# postFormShowHome
source: Show on home page
fr: Afficher sur la page d'accueil

# postFormShowRegistration
source: Show on Registration
fr: Afficher a l'inscription

# postFormCancel
source: Cancel
fr: Annuler

# postFormUpdate
source: Update Post
fr: Mettre a jour

# postFormPublish
source: Publish
fr: Publier

# postFormNotFound
source: Post not found
fr: Article introuvable

# postFormLoadError
source: Failed to load post
fr: Impossible de charger l'article

# postFormAuthRequired
source: You must be logged in to create a post
fr: Vous devez etre connecte pour creer un article

# postFormUpdateSuccess
source: Post updated successfully
fr: Article mis a jour avec succes

# postFormCreateSuccess
source: Post created successfully
fr: Article cree avec succes

# postFormSaveError
source: Failed to save post. Please try again.
fr: Echec de l'enregistrement. Veuillez reessayer.

# settingsTitle
source: Settings
fr: Parametres

# settingsProfile
source: Profile Information
fr: Informations du profil

# settingsProfilePicture
source: Profile Picture
fr: Photo de profil

# settingsAvatarPlaceholder
source: Avatar URL
fr: URL de l'avatar

# settingsFullName
source: Full Name
fr: Nom complet

# settingsSaveChanges
source: Save Changes
fr: Enregistrer les modifications

# settingsAccountInfo
source: Account Information
fr: Informations du compte

# settingsUserId
source: User ID
fr: ID utilisateur

# settingsMemberSince
source: Member Since
fr: Membre depuis

# settingsSaveSuccess
source: Profile updated successfully
fr: Profil mis a jour avec succes

# httpNetworkError
source: Network error. Please check your connection and try again.
fr: Erreur reseau. Verifiez votre connexion et reessayez.

# httpGenericError
source: Something went wrong. Please try again.
fr: Une erreur est survenue. Veuillez reessayer.

# blogUntitled
source: Untitled Post
fr: Article sans titre

# blogAuthorUnknown
source: Unknown
fr: Inconnu
